src/Documents/ШкалаБонусов/ШкалаБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ШкалаБонусов</name>
  <registerRecords>InformationRegister.ШкалаБонусов</registerRecords>
  <tabularSections>
    <name>Диапазоны</name>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерхняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентНакопления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ШкалаБонусов/ШкалаБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШкалаБонусов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Шкала</name>
    <type>
      <types>DocumentRef.ШкалаБонусов</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/Documents/ШкалаБонусов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ОписанияОшибок = Новый Массив;
	
	Если Диапазоны.Количество() = 0 Тогда
		
		Отказ = Истина;
		ОписанияОшибок.Добавить(Новый Структура("Текст, Поле", "Нужны диапазоны, братиш", "Диапазоны"));
		
	Иначе
		
		Если Диапазоны[0].НижняяГраница <> 0 Тогда
			
			Отказ = Истина;
			ОписанияОшибок.Добавить(Новый Структура("Текст, Поле", "Нижняя граница первого диапазона должна быть 0", "Диапазоны[0].НижняяГраница"));
			
		КонецЕсли;
			
		Если Диапазоны[Диапазоны.Количество() - 1].ВерхняяГраница <> 0 Тогда
			
			Отказ = Истина;
			ОписанияОшибок.Добавить(Новый Структура("Текст, Поле", "Верхняя граница последнего диапазона должна быть 0", СтрШаблон("Диапазоны[%1].ВерхняяГраница", XMLСтрока(Диапазоны.Количество() - 1))));
			
		КонецЕсли;
	
		Если НЕ ПроверитьГраницыДиапазонов(ОписанияОшибок).Результат Тогда
			
			Отказ = Истина;
			
		КонецЕсли;

	КонецЕсли;
	
	Если Отказ = Истина Тогда
		
		Для Каждого Ошибка Из ОписанияОшибок Цикл
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Ошибка.Текст;
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Поле = Ошибка.Поле;
			Сообщение.Сообщить();
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ШкалаБонусов
	Движения.ШкалаБонусов.Записывать = Истина;
	Движение = Движения.ШкалаБонусов.Добавить();
	Движение.Период = Дата;
	Движение.Шкала = Ссылка;

КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьГраницыДиапазонов(ОписанияОшибок)

	Перем СледующийДиапазон;
	
	Результат = Новый Структура("Результат, ОписанияОшибок", Истина, ОписанияОшибок);
	ПоследнийДиапазонНомер = Диапазоны.Количество() - 1;
	
	Для Сч = 0 По ПоследнийДиапазонНомер Цикл
		
		ЭтотДиапазон = Диапазоны[Сч];		
		
		Если ЭтотДиапазон.НижняяГраница >= ЭтотДиапазон.ВерхняяГраница Тогда
			
			Если Не Сч = ПоследнийДиапазонНомер Тогда

				Результат.Результат = Ложь;
				Текст = "Нижняя граница каждого диапазона (кроме последнего) должна быть меньше верхней границы";
				Поле = СтрШаблон("Диапазоны[%1].НижняяГраница", XMLСтрока(Сч));
				Ошибка = Новый Структура("Текст, Поле", Текст, Поле);
				Результат.ОписанияОшибок.Добавить(Ошибка);

			КонецЕсли;
			
		КонецЕсли;
		
		Если Не Сч = ПоследнийДиапазонНомер Тогда
			
			СледующийДиапазон = Диапазоны[Сч + 1];
			
			Если ЭтотДиапазон.ВерхняяГраница <> СледующийДиапазон.НижняяГраница Тогда
				
				Результат.Результат = Ложь;
				Текст = "Верхняя граница каждого диапазона (кроме последнего) должна равняться нижней границе следующего диапазона";
				Поле = СтрШаблон("Диапазоны[%1].ВерхняяГраница", XMLСтрока(Сч));
				Ошибка = Новый Структура("Текст, Поле", Текст, Поле);
				Результат.ОписанияОшибок.Добавить(Ошибка);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
